{"format": "graph-model", "generatedBy": "1.15.0", "convertedBy": "TensorFlow.js Converter v1.4.0", "userDefinedMetadata": {"signature": {"inputs": {"mix:0": {"name": "mix:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "1"}, {"size": "2"}, {"size": "1025"}]}}}, "outputs": {"vocals:0": {"name": "vocals:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "1"}, {"size": "2"}, {"size": "1025"}]}}}}}, "modelTopology": {"node": [{"name": "mix", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "256"}, {"size": "1"}, {"size": "2"}, {"size": "1025"}]}}}}, {"name": "Const_36", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "Const_37", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "Const_16", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "558"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Const_17", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "558"}]}}}}}, {"name": "Cast", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "Const_38", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "Squeeze", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "SparseToDense/default_value", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1116"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Cast_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "Const_40", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "transpose/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "Const_42", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "transpose_2/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "convolution/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "convolution/ExpandDims_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "2"}, {"size": "256"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Const_20", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Const_45", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "Const_46", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "convolution_1/ExpandDims_1", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "2"}, {"size": "256"}, {"size": "256"}]}}}}}, {"name": "Const_22", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}}, {"name": "Const_52", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}, {"size": "2"}]}}}}}, {"name": "convolution_2/SpaceToBatchND/block_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "convolution_2/SpaceToBatchND/paddings", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}, {"size": "2"}]}}}}}, {"name": "convolution_2/ExpandDims_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "2"}, {"size": "256"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Const_19", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1025"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Const_24", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "convolution_3/ExpandDims_1", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "2"}, {"size": "256"}, {"size": "256"}]}}}}}, {"name": "Const_26", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Const_62", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}, {"size": "2"}]}}}}}, {"name": "convolution_4/SpaceToBatchND/block_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "convolution_4/ExpandDims_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "2"}, {"size": "256"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Const_18", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1025"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Const_28", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "convolution_5/ExpandDims_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "2"}, {"size": "256"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Const_30", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Const_72", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "convolution_6/SpaceToBatchND/block_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "convolution_6/ExpandDims_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "2"}, {"size": "256"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Const_32", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}}, {"name": "convolution_7/ExpandDims_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "2"}, {"size": "256"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Const_34", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "transpose_25/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "concat_8", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "Const_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batchnorm_1/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batchnorm_1/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Const_3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "2050"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batchnorm_2/mul", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "2050"}]}}}}}, {"name": "batchnorm_2/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "2050"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Cast_3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "Const_84", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "Slice", "op": "Slice", "input": ["mix", "Const_36", "Const_37"], "attr": {"T": {"type": "DT_FLOAT"}, "Index": {"type": "DT_INT32"}}}, {"name": "SparseToDense", "op": "SparseToDense", "input": ["Squeeze", "Cast", "Squeeze", "SparseToDense/default_value"], "attr": {"T": {"type": "DT_INT64"}, "validate_indices": {"b": true}, "Tindices": {"type": "DT_INT64"}}}, {"name": "SparseToDense_1", "op": "SparseToDense", "input": ["Squeeze", "Cast_1", "Squeeze", "SparseToDense/default_value"], "attr": {"Tindices": {"type": "DT_INT64"}, "T": {"type": "DT_INT64"}, "validate_indices": {"b": true}}}, {"name": "SparseToDense_3", "op": "SparseToDense", "input": ["Squeeze", "Cast_3", "Squeeze", "SparseToDense/default_value"], "attr": {"Tindices": {"type": "DT_INT64"}, "T": {"type": "DT_INT64"}, "validate_indices": {"b": true}}}, {"name": "Add", "op": "Add", "input": ["Const_16", "Slice"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "add_1", "op": "AddV2", "input": ["Const_38", "SparseToDense"], "attr": {"T": {"type": "DT_INT64"}}}, {"name": "add_15", "op": "AddV2", "input": ["SparseToDense", "concat_8"], "attr": {"T": {"type": "DT_INT64"}}}, {"name": "add_2", "op": "AddV2", "input": ["Const_40", "SparseToDense_1"], "attr": {"T": {"type": "DT_INT64"}}}, {"name": "add_16", "op": "AddV2", "input": ["Const_84", "SparseToDense_3"], "attr": {"T": {"type": "DT_INT64"}}}, {"name": "Mul", "op": "Mul", "input": ["Add", "Const_17"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Reshape", "op": "Reshape", "input": ["Mul", "add_1"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT64"}}}, {"name": "MatMul", "op": "MatMul", "input": ["Reshape", "Const"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}}}, {"name": "batchnorm/mul_1", "op": "Mul", "input": ["MatMul", "batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batchnorm/add_1", "op": "AddV2", "input": ["batchnorm/mul_1", "batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Reshape_5", "op": "Reshape", "input": ["batchnorm/add_1", "add_2"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT64"}}}, {"name": "Relu", "op": "Relu", "input": ["Reshape_5"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "transpose", "op": "Transpose", "input": ["Relu", "transpose/perm"], "attr": {"T": {"type": "DT_FLOAT"}, "Tperm": {"type": "DT_INT32"}}}, {"name": "Pad", "op": "Pad", "input": ["transpose", "Const_42"], "attr": {"T": {"type": "DT_FLOAT"}, "Tpaddings": {"type": "DT_INT32"}}}, {"name": "transpose_2", "op": "Transpose", "input": ["Pad", "transpose_2/perm"], "attr": {"T": {"type": "DT_FLOAT"}, "Tperm": {"type": "DT_INT32"}}}, {"name": "convolution/ExpandDims", "op": "ExpandDims", "input": ["transpose_2", "convolution/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "convolution", "op": "Conv2D", "input": ["convolution/ExpandDims", "convolution/ExpandDims_1"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "padding": {"s": "VkFMSUQ="}}}, {"name": "convolution/Squeeze", "op": "Squeeze", "input": ["convolution"], "attr": {"squeeze_dims": {"list": {"i": ["1"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "Add_3", "op": "Add", "input": ["Const_20", "convolution/Squeeze"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "transpose_3", "op": "Transpose", "input": ["Add_3", "transpose_2/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "Slice_1", "op": "Slice", "input": ["transpose_3", "Const_45", "Const_46"], "attr": {"T": {"type": "DT_FLOAT"}, "Index": {"type": "DT_INT32"}}}, {"name": "Relu_1", "op": "Relu", "input": ["Slice_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Pad_1", "op": "Pad", "input": ["Relu_1", "Const_42"], "attr": {"T": {"type": "DT_FLOAT"}, "Tpaddings": {"type": "DT_INT32"}}}, {"name": "transpose_5", "op": "Transpose", "input": ["Pad_1", "transpose_2/perm"], "attr": {"T": {"type": "DT_FLOAT"}, "Tperm": {"type": "DT_INT32"}}}, {"name": "convolution_1/ExpandDims", "op": "ExpandDims", "input": ["transpose_5", "convolution/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "convolution_1", "op": "Conv2D", "input": ["convolution_1/ExpandDims", "convolution_1/ExpandDims_1"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "VkFMSUQ="}}}, {"name": "convolution_1/Squeeze", "op": "Squeeze", "input": ["convolution_1"], "attr": {"squeeze_dims": {"list": {"i": ["1"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "Add_4", "op": "Add", "input": ["Const_22", "convolution_1/Squeeze"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "transpose_6", "op": "Transpose", "input": ["Add_4", "transpose_2/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "Slice_2", "op": "Slice", "input": ["transpose_6", "Const_45", "Const_46"], "attr": {"T": {"type": "DT_FLOAT"}, "Index": {"type": "DT_INT32"}}}, {"name": "Relu_2", "op": "Relu", "input": ["Slice_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Add_5", "op": "Add", "input": ["Relu_2", "transpose"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Relu_3", "op": "Relu", "input": ["Add_5"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Pad_2", "op": "Pad", "input": ["Relu_3", "Const_52"], "attr": {"T": {"type": "DT_FLOAT"}, "Tpaddings": {"type": "DT_INT32"}}}, {"name": "transpose_8", "op": "Transpose", "input": ["Pad_2", "transpose_2/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "convolution_2/SpaceToBatchND", "op": "SpaceToBatchND", "input": ["transpose_8", "convolution_2/SpaceToBatchND/block_shape", "convolution_2/SpaceToBatchND/paddings"], "attr": {"Tpaddings": {"type": "DT_INT32"}, "Tblock_shape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "convolution_2/ExpandDims", "op": "ExpandDims", "input": ["convolution_2/SpaceToBatchND", "convolution/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "convolution_2", "op": "Conv2D", "input": ["convolution_2/ExpandDims", "convolution_2/ExpandDims_1"], "device": "/device:CPU:0", "attr": {"padding": {"s": "VkFMSUQ="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "convolution_2/Squeeze", "op": "Squeeze", "input": ["convolution_2"], "attr": {"squeeze_dims": {"list": {"i": ["1"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "convolution_2/BatchToSpaceND", "op": "BatchToSpaceND", "input": ["convolution_2/Squeeze", "convolution_2/SpaceToBatchND/block_shape", "convolution_2/SpaceToBatchND/paddings"], "attr": {"Tblock_shape": {"type": "DT_INT32"}, "Tcrops": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "Add_6", "op": "Add", "input": ["Const_24", "convolution_2/BatchToSpaceND"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "transpose_9", "op": "Transpose", "input": ["Add_6", "transpose_2/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "Slice_3", "op": "Slice", "input": ["transpose_9", "Const_45", "Const_46"], "attr": {"T": {"type": "DT_FLOAT"}, "Index": {"type": "DT_INT32"}}}, {"name": "Relu_4", "op": "Relu", "input": ["Slice_3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Pad_3", "op": "Pad", "input": ["Relu_4", "Const_52"], "attr": {"T": {"type": "DT_FLOAT"}, "Tpaddings": {"type": "DT_INT32"}}}, {"name": "transpose_11", "op": "Transpose", "input": ["Pad_3", "transpose_2/perm"], "attr": {"T": {"type": "DT_FLOAT"}, "Tperm": {"type": "DT_INT32"}}}, {"name": "convolution_3/SpaceToBatchND", "op": "SpaceToBatchND", "input": ["transpose_11", "convolution_2/SpaceToBatchND/block_shape", "convolution_2/SpaceToBatchND/paddings"], "attr": {"Tpaddings": {"type": "DT_INT32"}, "Tblock_shape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "convolution_3/ExpandDims", "op": "ExpandDims", "input": ["convolution_3/SpaceToBatchND", "convolution/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "convolution_3", "op": "Conv2D", "input": ["convolution_3/ExpandDims", "convolution_3/ExpandDims_1"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "VkFMSUQ="}}}, {"name": "convolution_3/Squeeze", "op": "Squeeze", "input": ["convolution_3"], "attr": {"squeeze_dims": {"list": {"i": ["1"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "convolution_3/BatchToSpaceND", "op": "BatchToSpaceND", "input": ["convolution_3/Squeeze", "convolution_2/SpaceToBatchND/block_shape", "convolution_2/SpaceToBatchND/paddings"], "attr": {"Tcrops": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "Tblock_shape": {"type": "DT_INT32"}}}, {"name": "Add_7", "op": "Add", "input": ["Const_26", "convolution_3/BatchToSpaceND"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "transpose_12", "op": "Transpose", "input": ["Add_7", "transpose_2/perm"], "attr": {"T": {"type": "DT_FLOAT"}, "Tperm": {"type": "DT_INT32"}}}, {"name": "Slice_4", "op": "Slice", "input": ["transpose_12", "Const_45", "Const_46"], "attr": {"T": {"type": "DT_FLOAT"}, "Index": {"type": "DT_INT32"}}}, {"name": "Relu_5", "op": "Relu", "input": ["Slice_4"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Add_8", "op": "Add", "input": ["Relu_3", "Relu_5"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Relu_6", "op": "Relu", "input": ["Add_8"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Pad_4", "op": "Pad", "input": ["Relu_6", "Const_62"], "attr": {"Tpaddings": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "transpose_14", "op": "Transpose", "input": ["Pad_4", "transpose_2/perm"], "attr": {"T": {"type": "DT_FLOAT"}, "Tperm": {"type": "DT_INT32"}}}, {"name": "convolution_4/SpaceToBatchND", "op": "SpaceToBatchND", "input": ["transpose_14", "convolution_4/SpaceToBatchND/block_shape", "convolution_2/SpaceToBatchND/paddings"], "attr": {"Tpaddings": {"type": "DT_INT32"}, "Tblock_shape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "convolution_4/ExpandDims", "op": "ExpandDims", "input": ["convolution_4/SpaceToBatchND", "convolution/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "convolution_4", "op": "Conv2D", "input": ["convolution_4/ExpandDims", "convolution_4/ExpandDims_1"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "VkFMSUQ="}}}, {"name": "convolution_4/Squeeze", "op": "Squeeze", "input": ["convolution_4"], "attr": {"squeeze_dims": {"list": {"i": ["1"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "convolution_4/BatchToSpaceND", "op": "BatchToSpaceND", "input": ["convolution_4/Squeeze", "convolution_4/SpaceToBatchND/block_shape", "convolution_2/SpaceToBatchND/paddings"], "attr": {"Tcrops": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "Tblock_shape": {"type": "DT_INT32"}}}, {"name": "Add_9", "op": "Add", "input": ["Const_28", "convolution_4/BatchToSpaceND"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "transpose_15", "op": "Transpose", "input": ["Add_9", "transpose_2/perm"], "attr": {"T": {"type": "DT_FLOAT"}, "Tperm": {"type": "DT_INT32"}}}, {"name": "Slice_5", "op": "Slice", "input": ["transpose_15", "Const_45", "Const_46"], "attr": {"T": {"type": "DT_FLOAT"}, "Index": {"type": "DT_INT32"}}}, {"name": "Relu_7", "op": "Relu", "input": ["Slice_5"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Pad_5", "op": "Pad", "input": ["Relu_7", "Const_62"], "attr": {"T": {"type": "DT_FLOAT"}, "Tpaddings": {"type": "DT_INT32"}}}, {"name": "transpose_17", "op": "Transpose", "input": ["Pad_5", "transpose_2/perm"], "attr": {"T": {"type": "DT_FLOAT"}, "Tperm": {"type": "DT_INT32"}}}, {"name": "convolution_5/SpaceToBatchND", "op": "SpaceToBatchND", "input": ["transpose_17", "convolution_4/SpaceToBatchND/block_shape", "convolution_2/SpaceToBatchND/paddings"], "attr": {"Tpaddings": {"type": "DT_INT32"}, "Tblock_shape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "convolution_5/ExpandDims", "op": "ExpandDims", "input": ["convolution_5/SpaceToBatchND", "convolution/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "convolution_5", "op": "Conv2D", "input": ["convolution_5/ExpandDims", "convolution_5/ExpandDims_1"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "VkFMSUQ="}}}, {"name": "convolution_5/Squeeze", "op": "Squeeze", "input": ["convolution_5"], "attr": {"squeeze_dims": {"list": {"i": ["1"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "convolution_5/BatchToSpaceND", "op": "BatchToSpaceND", "input": ["convolution_5/Squeeze", "convolution_4/SpaceToBatchND/block_shape", "convolution_2/SpaceToBatchND/paddings"], "attr": {"T": {"type": "DT_FLOAT"}, "Tblock_shape": {"type": "DT_INT32"}, "Tcrops": {"type": "DT_INT32"}}}, {"name": "Add_10", "op": "Add", "input": ["Const_30", "convolution_5/BatchToSpaceND"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "transpose_18", "op": "Transpose", "input": ["Add_10", "transpose_2/perm"], "attr": {"T": {"type": "DT_FLOAT"}, "Tperm": {"type": "DT_INT32"}}}, {"name": "Slice_6", "op": "Slice", "input": ["transpose_18", "Const_45", "Const_46"], "attr": {"T": {"type": "DT_FLOAT"}, "Index": {"type": "DT_INT32"}}}, {"name": "Relu_8", "op": "Relu", "input": ["Slice_6"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Add_11", "op": "Add", "input": ["Relu_6", "Relu_8"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Relu_9", "op": "Relu", "input": ["Add_11"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Pad_6", "op": "Pad", "input": ["Relu_9", "Const_72"], "attr": {"T": {"type": "DT_FLOAT"}, "Tpaddings": {"type": "DT_INT32"}}}, {"name": "transpose_20", "op": "Transpose", "input": ["Pad_6", "transpose_2/perm"], "attr": {"T": {"type": "DT_FLOAT"}, "Tperm": {"type": "DT_INT32"}}}, {"name": "convolution_6/SpaceToBatchND", "op": "SpaceToBatchND", "input": ["transpose_20", "convolution_6/SpaceToBatchND/block_shape", "convolution_2/SpaceToBatchND/paddings"], "attr": {"T": {"type": "DT_FLOAT"}, "Tpaddings": {"type": "DT_INT32"}, "Tblock_shape": {"type": "DT_INT32"}}}, {"name": "convolution_6/ExpandDims", "op": "ExpandDims", "input": ["convolution_6/SpaceToBatchND", "convolution/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "convolution_6", "op": "Conv2D", "input": ["convolution_6/ExpandDims", "convolution_6/ExpandDims_1"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "padding": {"s": "VkFMSUQ="}}}, {"name": "convolution_6/Squeeze", "op": "Squeeze", "input": ["convolution_6"], "attr": {"squeeze_dims": {"list": {"i": ["1"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "convolution_6/BatchToSpaceND", "op": "BatchToSpaceND", "input": ["convolution_6/Squeeze", "convolution_6/SpaceToBatchND/block_shape", "convolution_2/SpaceToBatchND/paddings"], "attr": {"T": {"type": "DT_FLOAT"}, "Tblock_shape": {"type": "DT_INT32"}, "Tcrops": {"type": "DT_INT32"}}}, {"name": "Add_12", "op": "Add", "input": ["Const_32", "convolution_6/BatchToSpaceND"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "transpose_21", "op": "Transpose", "input": ["Add_12", "transpose_2/perm"], "attr": {"T": {"type": "DT_FLOAT"}, "Tperm": {"type": "DT_INT32"}}}, {"name": "Slice_7", "op": "Slice", "input": ["transpose_21", "Const_45", "Const_46"], "attr": {"T": {"type": "DT_FLOAT"}, "Index": {"type": "DT_INT32"}}}, {"name": "Relu_10", "op": "Relu", "input": ["Slice_7"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Pad_7", "op": "Pad", "input": ["Relu_10", "Const_72"], "attr": {"T": {"type": "DT_FLOAT"}, "Tpaddings": {"type": "DT_INT32"}}}, {"name": "transpose_23", "op": "Transpose", "input": ["Pad_7", "transpose_2/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "convolution_7/SpaceToBatchND", "op": "SpaceToBatchND", "input": ["transpose_23", "convolution_6/SpaceToBatchND/block_shape", "convolution_2/SpaceToBatchND/paddings"], "attr": {"Tpaddings": {"type": "DT_INT32"}, "Tblock_shape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "convolution_7/ExpandDims", "op": "ExpandDims", "input": ["convolution_7/SpaceToBatchND", "convolution/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "convolution_7", "op": "Conv2D", "input": ["convolution_7/ExpandDims", "convolution_7/ExpandDims_1"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "padding": {"s": "VkFMSUQ="}}}, {"name": "convolution_7/Squeeze", "op": "Squeeze", "input": ["convolution_7"], "attr": {"squeeze_dims": {"list": {"i": ["1"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "convolution_7/BatchToSpaceND", "op": "BatchToSpaceND", "input": ["convolution_7/Squeeze", "convolution_6/SpaceToBatchND/block_shape", "convolution_2/SpaceToBatchND/paddings"], "attr": {"T": {"type": "DT_FLOAT"}, "Tblock_shape": {"type": "DT_INT32"}, "Tcrops": {"type": "DT_INT32"}}}, {"name": "Add_13", "op": "Add", "input": ["Const_34", "convolution_7/BatchToSpaceND"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "transpose_24", "op": "Transpose", "input": ["Add_13", "transpose_2/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "Slice_8", "op": "Slice", "input": ["transpose_24", "Const_45", "Const_46"], "attr": {"T": {"type": "DT_FLOAT"}, "Index": {"type": "DT_INT32"}}}, {"name": "Relu_11", "op": "Relu", "input": ["Slice_8"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Add_14", "op": "Add", "input": ["Relu_11", "Relu_9"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Relu_12", "op": "Relu", "input": ["Add_14"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "transpose_25", "op": "Transpose", "input": ["Relu_12", "transpose_25/perm"], "attr": {"T": {"type": "DT_FLOAT"}, "Tperm": {"type": "DT_INT32"}}}, {"name": "Reshape_6", "op": "Reshape", "input": ["transpose_25", "add_15"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT64"}}}, {"name": "MatMul_1", "op": "MatMul", "input": ["Reshape_6", "Const_2"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}, "transpose_b": {"b": false}}}, {"name": "batchnorm_1/mul_1", "op": "Mul", "input": ["MatMul_1", "batchnorm_1/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batchnorm_1/add_1", "op": "AddV2", "input": ["batchnorm_1/mul_1", "batchnorm_1/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Relu_13", "op": "Relu", "input": ["batchnorm_1/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MatMul_2", "op": "MatMul", "input": ["Relu_13", "Const_3"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "batchnorm_2/mul_1", "op": "Mul", "input": ["MatMul_2", "batchnorm_2/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batchnorm_2/add_1", "op": "AddV2", "input": ["batchnorm_2/mul_1", "batchnorm_2/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Reshape_15", "op": "Reshape", "input": ["batchnorm_2/add_1", "add_16"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT64"}}}, {"name": "Mul_1", "op": "Mul", "input": ["Const_19", "Reshape_15"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Add_17", "op": "Add", "input": ["Const_18", "Mul_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Sigmoid", "op": "Sigmoid", "input": ["Add_17"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "vocals", "op": "Mul", "input": ["Sigmoid", "mix"], "attr": {"T": {"type": "DT_FLOAT"}}}], "versions": {"producer": 134}}, "weightsManifest": [{"paths": ["group1-shard1of2.bin", "group1-shard2of2.bin"], "weights": [{"name": "Const_36", "shape": [4], "dtype": "int32"}, {"name": "Const_37", "shape": [4], "dtype": "int32"}, {"name": "Const_16", "shape": [558], "dtype": "float32"}, {"name": "Const_17", "shape": [558], "dtype": "float32"}, {"name": "Cast", "shape": [1], "dtype": "int32"}, {"name": "Const_38", "shape": [2], "dtype": "int32"}, {"name": "Squeeze", "shape": [0], "dtype": "int32"}, {"name": "SparseToDense/default_value", "shape": [], "dtype": "int32"}, {"name": "Const", "shape": [1116, 256], "dtype": "float32"}, {"name": "batchnorm/mul", "shape": [1, 256], "dtype": "float32"}, {"name": "batchnorm/sub", "shape": [1, 256], "dtype": "float32"}, {"name": "Cast_1", "shape": [1], "dtype": "int32"}, {"name": "Const_40", "shape": [3], "dtype": "int32"}, {"name": "transpose/perm", "shape": [3], "dtype": "int32"}, {"name": "Const_42", "shape": [3, 2], "dtype": "int32"}, {"name": "transpose_2/perm", "shape": [3], "dtype": "int32"}, {"name": "convolution/ExpandDims/dim", "shape": [], "dtype": "int32"}, {"name": "convolution/ExpandDims_1", "shape": [1, 2, 256, 256], "dtype": "float32"}, {"name": "Const_20", "shape": [256], "dtype": "float32"}, {"name": "Const_45", "shape": [3], "dtype": "int32"}, {"name": "Const_46", "shape": [3], "dtype": "int32"}, {"name": "convolution_1/ExpandDims_1", "shape": [1, 2, 256, 256], "dtype": "float32"}, {"name": "Const_22", "shape": [256], "dtype": "float32"}, {"name": "Const_52", "shape": [3, 2], "dtype": "int32"}, {"name": "convolution_2/SpaceToBatchND/block_shape", "shape": [1], "dtype": "int32"}, {"name": "convolution_2/SpaceToBatchND/paddings", "shape": [1, 2], "dtype": "int32"}, {"name": "convolution_2/ExpandDims_1", "shape": [1, 2, 256, 256], "dtype": "float32"}, {"name": "Const_19", "shape": [1025], "dtype": "float32"}, {"name": "Const_24", "shape": [256], "dtype": "float32"}, {"name": "convolution_3/ExpandDims_1", "shape": [1, 2, 256, 256], "dtype": "float32"}, {"name": "Const_26", "shape": [256], "dtype": "float32"}, {"name": "Const_62", "shape": [3, 2], "dtype": "int32"}, {"name": "convolution_4/SpaceToBatchND/block_shape", "shape": [1], "dtype": "int32"}, {"name": "convolution_4/ExpandDims_1", "shape": [1, 2, 256, 256], "dtype": "float32"}, {"name": "Const_18", "shape": [1025], "dtype": "float32"}, {"name": "Const_28", "shape": [256], "dtype": "float32"}, {"name": "convolution_5/ExpandDims_1", "shape": [1, 2, 256, 256], "dtype": "float32"}, {"name": "Const_30", "shape": [256], "dtype": "float32"}, {"name": "Const_72", "shape": [3, 2], "dtype": "int32"}, {"name": "convolution_6/SpaceToBatchND/block_shape", "shape": [1], "dtype": "int32"}, {"name": "convolution_6/ExpandDims_1", "shape": [1, 2, 256, 256], "dtype": "float32"}, {"name": "Const_32", "shape": [256], "dtype": "float32"}, {"name": "convolution_7/ExpandDims_1", "shape": [1, 2, 256, 256], "dtype": "float32"}, {"name": "Const_34", "shape": [256], "dtype": "float32"}, {"name": "transpose_25/perm", "shape": [3], "dtype": "int32"}, {"name": "concat_8", "shape": [2], "dtype": "int32"}, {"name": "Const_2", "shape": [256, 256], "dtype": "float32"}, {"name": "batchnorm_1/mul", "shape": [1, 256], "dtype": "float32"}, {"name": "batchnorm_1/sub", "shape": [1, 256], "dtype": "float32"}, {"name": "Const_3", "shape": [256, 2050], "dtype": "float32"}, {"name": "batchnorm_2/mul", "shape": [1, 2050], "dtype": "float32"}, {"name": "batchnorm_2/sub", "shape": [1, 2050], "dtype": "float32"}, {"name": "Cast_3", "shape": [1], "dtype": "int32"}, {"name": "Const_84", "shape": [4], "dtype": "int32"}]}]}